SM_для_EDT/src/Documents/рарусМероприятиеСУБ/рарусМероприятиеСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусМероприятиеСУБ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоИнспектора</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.рарусРезультатыВыполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийОрган</name>
    <type>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.рарусВидыМероприятийСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиПланГрафика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МероприятиеПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеМероприятия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>DocumentRef.Анкета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнспекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыСудов</name>
    <type>
      <types>CatalogRef.рарусСвидетельстваСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтчетаOCIMF</name>
    <comment>zalikh, для связи с отчетом аудитора с сайта OCIMF</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <comment>zalikh</comment>
    <attributes>
      <name>Требование</name>
      <type>
        <types>CatalogRef.рарусТребования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Enums/рарусОбластиРедактирования/рарусОбластиРедактирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусОбластиРедактирования</name>
  <comment>rarus PleA ФТ.СНБ.01.01</comment>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>Берег</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусТипыМероприятия/рарусТипыМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусТипыМероприятия</name>
  <enumValues>
    <name>ОсвидетельствованиеСудна</name>
  </enumValues>
  <enumValues>
    <name>ОсвидетельствованиеКомпании</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийАудит</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийАудит</name>
  </enumValues>
  <enumValues>
    <name>Учение</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/vftНесоответствия/vftНесоответствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftНесоответствия</name>
  <owners>Catalog.vftДокладыОНесоответствии</owners>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийНесоответствие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРешениеКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеКорректирующийхДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйРешение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйРешение</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПринятыеДляУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийДонесение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДонесенияОбУстранении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДонесения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуютсяПредупреждающиеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПоПредотвращениюПовторенияНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиПредупреждающихДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗамечания</name>
    <type>
      <types>EnumRef.рарусТипыЗамечания</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.рарусЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУстраненияЗамечания</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовУстраненияЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗамечаний</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторяющеесяЗамечания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПКД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниеЗакрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаЗакрытиеЗамечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЗамечания</name>
    <type>
      <types>CatalogRef.vftДокладыОНесоответствии</types>
      <types>DocumentRef.рарусМероприятиеСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросАнкетирования</name>
    <comment>rarus zalikh</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеССайтаOCIMF</name>
    <comment>zalikh</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОВыполненииПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаОтметкуОВыполнении</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеПодразделенияЗаПредупреждающиеДействия</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныОтветственности</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗанаОтветственности</name>
      <type>
        <types>CatalogRef.рарусЗоныОтветственности</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректирующиеДействия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемыеСрокиУстранения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьОтветственного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИООтветственного</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПоЗамечанию</name>
    <attributes>
      <name>ДокументОтражающийДефект</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
        <types>DocumentRef.впВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Documents/рарусМероприятиеСУБ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбластьСоздания) Тогда
		ОбластьСоздания = Перечисления.рарусОбластиРедактирования.Судно;	
	КонецЕсли;
	
	рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);
					
КонецПроцедуры	
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИСТИНА 
		|ИЗ
		|	Справочник.vftНесоответствия КАК vftНесоответствия
		|ГДЕ
		|	vftНесоответствия.ВладелецЗамечания = &ВладелецЗамечания
		|	И НЕ vftНесоответствия.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ВладелецЗамечания", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			ТекстОшибки = НСтр("ru = 'По данному мероприятию уже созданы замечания';
			|en = 'Comments have already been created for this event.'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"",
			,
			Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("Судно");
		МассивНепроверяемыхРеквизитов.Добавить("МестоПроведения");	
		МассивНепроверяемыхРеквизитов.Добавить("ДатаИнспекции");		
		МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");	
		МассивНепроверяемыхРеквизитов.Добавить("ФиоИнспектора");		
	КонецЕсли;
		
	ТипМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидМероприятия, "ТипМероприятия");
	
	Если ТипМероприятия <> Неопределено Тогда
		Если ТипМероприятия = Перечисления.рарусТипыМероприятия.ОсвидетельствованиеСудна 
			Или ТипМероприятия = Перечисления.рарусТипыМероприятия.ВнешнийАудит
			Или ТипМероприятия = Перечисления.рарусТипыМероприятия.ОсвидетельствованиеКомпании Тогда 
			МассивНепроверяемыхРеквизитов.Добавить("ФиоИнспектора");					
		КонецЕсли;
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик;
	
	ИдентификаторСтрокиПланГрафика = " ";
	МероприятиеПоПлану = Ложь;
	ПредставлениеМероприятия = " ";
	
	// ++ rarus zalikh 2021-05-24 [27313]
	Анкета = Документы.Анкета.ПустаяСсылка();
	// -- rarus zalikh 2021-05-24 [27313]
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
